[
  {
    "id": 1,
    "name": "Grilled Salmon",
    "name2": "Spicy Shrimp Linguine",
    "name3": "Beef and Broccoli Stir Fry",
    "ingredients": "salmon fillet, olive oil, salt, pepper, lemon",
    "ingredients2": "shrimp, linguine pasta, red pepper flakes, garlic, heavy cream, parmesan cheese",
    "ingredients3": "beef sirloin, broccoli florets, soy sauce, vegetable oil, garlic, cornstarch",
    "cooking_method": "Preheat the grill to medium-high heat. Brush the salmon with olive oil and season with salt and pepper. Grill the salmon for about 6-8 minutes per side or until cooked through. Squeeze fresh lemon juice over the top before serving.",
    "cooking_method2": "Cook linguine according to package instructions. Sauté shrimp in a pan with garlic and red pepper flakes until pink. Add heavy cream and grated parmesan cheese, then toss with linguine.",
    "cooking_method3": "Slice beef into thin strips. Sauté beef and garlic in a wok or pan with vegetable oil. Add broccoli florets and soy sauce. Mix cornstarch with water and add to the pan to thicken sauce.",
    "rating": "4.5/5",
    "rating2": "4.7/5",
    "rating3": "4.3/5"
  },
  {
    "id": 2,
    "name": "Chicken Alfredo Pasta",
    "name2": "Baked Teriyaki Chicken",
    "name3": "Spicy Beef Stir-Fry",
    "ingredients": "fettuccine pasta, chicken breast, heavy cream, butter, garlic, parmesan cheese, salt, black pepper",
    "ingredients2": "chicken thighs, teriyaki sauce, soy sauce, honey, garlic, onion, cornstarch, sesame seeds, green onions",
    "ingredients3": "beef sirloin, bell peppers, onion, garlic, ginger, soy sauce, honey, sriracha sauce, vegetable oil",
    "cooking_method": "Cook fettuccine pasta according to package instructions. In a separate pan, cook diced chicken breast with minced garlic and butter until browned. Add heavy cream and grated parmesan cheese. Cook over low heat until the sauce thickens. Season with salt and black pepper. Toss the cooked pasta with the chicken alfredo sauce.",
    "cooking_method2": "Preheat oven to 375°F. Mix together teriyaki sauce, soy sauce, honey, minced garlic, and diced onion. Place chicken thighs in a baking dish and pour the sauce mixture over the top. Bake for 30-35 minutes or until fully cooked. Top with sliced green onions and sesame seeds before serving.",
    "cooking_method3": "Slice beef into thin strips. Sauté beef, diced onion, sliced bell peppers, minced garlic, and grated ginger in vegetable oil until cooked through. In a separate bowl, mix together soy sauce, honey, and sriracha sauce. Pour the sauce over the beef and vegetables and stir to coat. Serve hot.",
    "rating": "4.8/5",
    "rating2": "4.6/5",
    "rating3": "4.2/5"
  },
  {
    "id": 3,
    "name": "Roasted Vegetables with Quinoa",
    "name2": "Tomato and Basil Bruschetta",
    "name3": "Mushroom and Spinach Risotto",
    "ingredients": "sweet potato, broccoli florets, red onion, olive oil, salt, black pepper, quinoa, vegetable broth",
    "ingredients2": "baguette, tomatoes, fresh basil, garlic, balsamic vinegar, olive oil",
    "ingredients3": "arborio rice, chicken broth, white wine, mushrooms, spinach, onion, garlic, parmesan cheese, butter",
    "cooking_method": "Preheat oven to 400°F. Cut sweet potatoes and red onions into bite-sized pieces. Spread the sweet potatoes, broccoli florets, and red onions out on a sheet pan. Drizzle with olive oil and season with salt and black pepper. Roast in the oven for about 20-25 minutes or until tender. Cook quinoa according to package instructions using vegetable broth instead of water. Serve roasted vegetables over cooked quinoa.",
    "cooking_method2":"Slice baguette and brush with olive oil. Bake in the oven until lightly toasted. Meanwhile, dice tomatoes and fresh basil. In a bowl, mix together diced tomatoes, chopped basil, minced garlic, balsamic vinegar, and olive oil. Season with salt and black pepper. Top each slice of toasted baguette with a spoonful of tomato mixture.",
    "cooking_method3": "Sauté diced onion and minced garlic in olive oil and butter until softened. Add sliced mushrooms and cook until tender. Stir in arborio rice and cook for 1-2 minutes. Add white wine and simmer until fully absorbed. Gradually add chicken broth, stirring constantly, until rice is cooked through. Stir in grated parmesan cheese and wilted spinach. Serve hot.",
    "rating": "4.5/5",
    "rating2": "4.6/5",
    "rating3": "4.9/5"
  },
  {
    "id": 4,
    "name": "Beef Stroganoff",
    "name2": "Lemon Garlic Shrimp Scampi",
    "name3": "Chicken Fajitas",
    "ingredients": "beef sirloin, onion, garlic, mushrooms, beef broth, sour cream, dijon mustard, egg noodles",
    "ingredients2": "shrimp, angel hair pasta, lemon, butter, garlic, white wine, chicken broth, red pepper flakes",
    "ingredients3": "chicken breasts, bell peppers, onion, flour tortillas, cheddar cheese, sour cream, salsa, guacamole",
    "cooking_method": "Cut beef sirloin into thin strips. Sauté beef, diced onion, minced garlic, and sliced mushrooms in butter until browned. Add beef broth and simmer until the liquid has reduced by half. Stir in sour cream and dijon mustard. Serve over cooked egg noodles.",
    "cooking_method2": "Cook angel hair pasta according to package instructions. Meanwhile, sauté shrimp in a pan with minced garlic and butter until pink. Add white wine, chicken broth, lemon juice, and red pepper flakes. Simmer until sauce thickens slightly. Toss the cooked pasta with the shrimp scampi sauce.",
    "cooking_method3": "Slice chicken breasts into thin strips. Sauté chicken, sliced bell peppers, and diced onion in vegetable oil until cooked through. Heat flour tortillas in the oven or microwave. Serve chicken fajitas on warm tortillas topped with shredded cheddar cheese, sour cream, salsa, and guacamole.",
    "rating": "4.7/5",
    "rating2": "4.8/5",
    "rating3": "4.4/5"
  },
  
  {
    "id": 5,
    "name": "Vegetable Stir Fry",
    "name2": "Beef and Cheese Enchiladas",
    "name3": "Pesto Pasta Salad",
    "ingredients": "broccoli florets, snow peas, carrots, bell peppers, onion, garlic, soy sauce, sesame oil, cornstarch, rice",
    "ingredients2": "ground beef, chili powder, cumin, garlic powder, onion powder, tomato sauce, enchilada sauce, flour tortillas, cheddar cheese",
    "ingredients3": "fusilli pasta, pesto sauce, cherry tomatoes, sliced black olives, grated parmesan cheese, olive oil",
    "cooking_method": "Cut broccoli florets, snow peas, carrots, and bell peppers into bite-sized pieces. Sauté vegetables, diced onion, and minced garlic in sesame oil until tender. In a separate bowl, mix together soy sauce and cornstarch. Add the soy sauce mixture to the pan and stir to coat the vegetables. Serve over cooked rice.",
    "cooking_method2": "Brown ground beef in a skillet over medium-high heat. Add chili powder, cumin, garlic powder, onion powder, tomato sauce, and enchilada sauce. Simmer until heated through. Heat flour tortillas in the oven or microwave. Roll up beef mixture and shredded cheddar cheese in tortillas. Place enchiladas in a baking dish and bake at 350°F for about 20 minutes or until cheese is melted and bubbly.",
    "cooking_method3": "Cook fusilli pasta according to package instructions. In a separate bowl, mix together pesto sauce, halved cherry tomatoes, sliced black olives, grated parmesan cheese, and olive oil. Toss the cooked pasta with the pesto mixture. Serve cold.",
    "rating": "4.6/5",
    "rating2": "4.9/5",
    "rating3": "4.3/5"
  },
  {
    "id": 6,
    "name": "Teriyaki Tofu Bowl",
    "name2": "Garlic Butter Shrimp",
    "name3": "Spinach and Ricotta Stuffed Shells",
    "ingredients": "extra firm tofu, teriyaki sauce, soy sauce, rice vinegar, honey, garlic, ginger, broccoli florets, brown rice",
    "ingredients2": "shrimp, butter, minced garlic, lemon juice, parsley, red pepper flakes",
    "ingredients3": "jumbo pasta shells, ricotta cheese, grated parmesan cheese, chopped spinach, egg, garlic, marinara sauce",
    "cooking_method": "Drain and press extra firm tofu to remove excess water. Cut tofu into bite-sized pieces. In a separate bowl, mix together teriyaki sauce, soy sauce, rice vinegar, honey, minced garlic, and grated ginger. Marinate the tofu in the sauce for at least 30 minutes. Sauté marinated tofu and broccoli florets in a pan until heated through. Serve over cooked brown rice.",
    "cooking_method2": "Melt butter in a skillet over medium heat. Add minced garlic and red pepper flakes. Sauté shrimp until pink. Squeeze fresh lemon juice over the top and sprinkle with chopped parsley. Serve hot.",
    "cooking_method3": "Cook jumbo pasta shells according to package instructions. In a separate bowl, mix together ricotta cheese, grated parmesan cheese, chopped spinach, egg, minced garlic, salt, and black pepper. Stuff each cooked pasta shell with the ricotta mixture. Pour marinara sauce over the stuffed shells. Bake at 375°F for about 20-25 minutes or until heated through.",
    "rating": "4.2/5",
    "rating2": "4.7/5",
    "rating3": "4.5/5"
  }
]
